tap "homebrew/bundle"
brew "ack"
brew "bash-completion"
brew "fzf"
brew "git"
brew "go"
brew "jq"
brew "neovim"
brew "node"
brew "nvm"
brew "python@3.12"
brew "telnet"
brew "tig"
brew "tree"
brew "vips"
brew "zsh"
cask "apifox"
cask "arc"
cask "dingtalk"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keycastr"
cask "keyclu"
cask "obs"
cask "orbstack"
cask "picgo"
cask "raycast"
cask "sfm"
cask "snipaste"
cask "spotify"
cask "visual-studio-code"
cask "wechat"
cask "xcodes"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clysto.plantuml"
vscode "codesandbox-io.codesandbox-projects"
vscode "donebd.rest-client-api"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "intellsmi.comment-translate"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jdinhlife.gruvbox"
vscode "jebbs.plantuml"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "mustidev.react-snippets"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pleiades.java-extension-pack-jdk"
vscode "prisma.prisma"
vscode "redguardtoo.matchit"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
